IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_G3_EPWM29_CONTROLSS_G3_EPWM29.xml
	<register id="CONTROLSS_G3_EPWM29_EPWMXLINK2" acronym="CONTROLSS_G3_EPWM29_EPWMXLINK2" offset="0x74" width="32" description="EPWMx Link 2 Register [[br]] [[br]]This register controls which EPWMs are linked to other EPWM modules.  The default reset value will vary for each module.  The reset value will link each EPWM module to itself to prevent unintentional linking of modules.">
		<bitfield id="DBFEDLINK" width="5" begin="9" end="5" resetval="0x0" description="DBFED_DBFEDHR Link Bits  Writes to the DBFED:DBFEDHR registers in the ePWM module selected by the following bit selections results in a simultaneous write to the current ePWM module's DBFED_DBFEDHR registers.   00000: ePWM1  00001: ePWM2  00010: ePWM3  00011: ePWM4  00100: ePWM5   00101: ePWM6  00110: ePWM7   00111: ePWM8  01000: ePWM9  01001: ePWM10  01010: ePWM11  01011: ePWM12  01100: ePWM13  ...  11111: ePWM32" range="9 - 5" rwaccess="R/W"/> 
		<bitfield id="DBREDLINK" width="5" begin="4" end="0" resetval="0x0" description="DBRED_DBREDHR Link Bits  Writes to the DBRED:DBREDHR registers in the ePWM module selected by the following bit selections results in a simultaneous write to the current ePWM module's DBRED_DBREDHR registers.   00000: ePWM1  00001: ePWM2  00010: ePWM3  00011: ePWM4  00100: ePWM5   00101: ePWM6  00110: ePWM7   00111: ePWM8  01000: ePWM9  01001: ePWM10  01010: ePWM11  01011: ePWM12  01100: ePWM13  ...  11111: ePWM32" range="4 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G3_EPWM29_ETEST" acronym="CONTROLSS_G3_EPWM29_ETEST" offset="0x7A" width="16" description="EPWM Test Register">
		<bitfield id="CMPFIX_OVERRIDE" width="1" begin="0" end="0" resetval="0x1" description="0: Bug fix overriden 1: Bug fix takes effect" range="0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G3_EPWM29_EPWMREV" acronym="CONTROLSS_G3_EPWM29_EPWMREV" offset="0x7C" width="16" description="EPWM Revision Register">
		<bitfield id="TYPE" width="8" begin="15" end="8" resetval="0x5" description="EPWM Type Bits: These bits specify the EPWM type. These bits are changed if the functionality of the EPWM is changed or any feature is added or removed:" range="15 - 8" rwaccess="R"/> 
		<bitfield id="REV" width="8" begin="7" end="0" resetval="0x0" description="EPWM Silicon Revision Bits: These bits specify the EPWM revision. These bits are changed if any bug fixes are performed:" range="7 - 0" rwaccess="R"/>
	</register>
	<register id="CONTROLSS_G3_EPWM29_HRPWMREV" acronym="CONTROLSS_G3_EPWM29_HRPWMREV" offset="0x7E" width="16" description="High Resolution Revision Register">
		<bitfield id="TYPE" width="8" begin="15" end="8" resetval="0x3" description="HRPWM Type Bits: These bits specify the HRPWM type. These bits are changed if the functionality of the HRPWM is changed or any feature is added or removed:" range="15 - 8" rwaccess="R"/> 
		<bitfield id="REV" width="8" begin="7" end="0" resetval="0x0" description="HRPWM Silicon Revision Bits: These bits specify the HRPWM revision. These bits are changed if any bug fixes are performed:" range="7 - 0" rwaccess="R"/>
	</register>
	<register id="CONTROLSS_G3_EPWM29_AQCTLA" acronym="CONTROLSS_G3_EPWM29_AQCTLA" offset="0x80" width="16" description="Action Qualifier Control Register For Output A ">
		<bitfield id="CBD" width="2" begin="11" end="10" resetval="0x0" description="Action When TBCTR = CMPB on Down Count  Note: By definition, in count up-down mode when the counter equals 0 the direction is defined as 1 or counting up.   00: Do nothing [action disabled]  01: Clear: force EPWMxA output low.  10: Set: force EPWMxA output high.  11: Toggle EPWMxA output: low output signal will be forced high, and a high signal will be forced low." range="11 - 10" rwaccess="R/W"/> 
		<bitfield id="CBU" width="2" begin="9" end="8" resetval="0x0" description="Action When TBCTR = CMPB on Up Count  Note: By definition, in count up-down mode when the counter equals 0 the direction is defined as 1 or counting up.   00: Do nothing [action disabled]  01: Clear: force EPWMxA output low.  10: Set: force EPWMxA output high.  11: Toggle EPWMxA output: low output signal will be forced high, and a high signal will be forced low." range="9 - 8" rwaccess="R/W"/> 
		<bitfield id="CAD" width="2" begin="7" end="6" resetval="0x0" description="Action When TBCTR = CMPA on Down Count  Note: By definition, in count up-down mode when the counter equals 0 the direction is defined as 1 or counting up.   00: Do nothing [action disabled]  01: Clear: force EPWMxA output low.  10: Set: force EPWMxA output high.  11: Toggle EPWMxA output: low output signal will be forced high, and a high signal will be forced low." range="7 - 6" rwaccess="R/W"/> 
		<bitfield id="CAU" width="2" begin="5" end="4" resetval="0x0" description="Action When TBCTR = CMPA on Up Count  Note: By definition, in count up-down mode when the counter equals 0 the direction is defined as 1 or counting up.   00: Do nothing [action disabled]  01: Clear: force EPWMxA output low.  10: Set: force EPWMxA output high.  11: Toggle EPWMxA output: low output signal will be forced high, and a high signal will be forced low." range="5 - 4" rwaccess="R/W"/> 
		<bitfield id="PRD" width="2" begin="3" end="2" resetval="0x0" description="Action When TBCTR = TBPRD  Note: By definition, in count up-down mode when the counter equals 0 the direction is defined as 1 or counting up.   00: Do nothing [action disabled]  01: Clear: force EPWMxA output low.  10: Set: force EPWMxA output high.  11: Toggle EPWMxA output: low output signal will be forced high, and a high signal will be forced low." range="3 - 2" rwaccess="R/W"/> 
		<bitfield id="ZRO" width="2" begin="1" end="0" resetval="0x0" description="Action When TBCTR = 0  Note: By definition, in count up-down mode when the counter equals 0 the direction is defined as 1 or counting up.   00: Do nothing [action disabled]  01: Clear: force EPWMxA output low.  10: Set: force EPWMxA output high.  11: Toggle EPWMxA output: low output signal will be forced high, and a high signal will be forced low." range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G3_EPWM29_AQCTLA2" acronym="CONTROLSS_G3_EPWM29_AQCTLA2" offset="0x82" width="16" description="Additional Action Qualifier Control Register For Output A ">
		<bitfield id="T2D" width="2" begin="7" end="6" resetval="0x0" description="Action when event occurs on T2 in DOWN-Count  Note: By definition, in count up-down mode when the counter equals 0 the direction is defined as 1 or counting up.   00: Do nothing [action disabled]  01: Clear: force EPWMxA output low.  10: Set: force EPWMxA output high.  11: Toggle EPWMxA output: low output signal will be forced high, and a high signal will be forced low." range="7 - 6" rwaccess="R/W"/> 
		<bitfield id="T2U" width="2" begin="5" end="4" resetval="0x0" description="Action when event occurs on T2 in UP-Count  Note: By definition, in count up-down mode when the counter equals 0 the direction is defined as 1 or counting up.   00: Do nothing [action disabled]  01: Clear: force EPWMxA output low.  10: Set: force EPWMxA output high.  11: Toggle EPWMxA output: low output signal will be forced high, and a high signal will be forced low." range="5 - 4" rwaccess="R/W"/> 
		<bitfield id="T1D" width="2" begin="3" end="2" resetval="0x0" description="Action when event occurs on T1 in DOWN-Count  Note: By definition, in count up-down mode when the counter equals 0 the direction is defined as 1 or counting up.   00: Do nothing [action disabled]  01: Clear: force EPWMxA output low.  10: Set: force EPWMxA output high.  11: Toggle EPWMxA output: low output signal will be forced high, and a high signal will be forced low." range="3 - 2" rwaccess="R/W"/> 
		<bitfield id="T1U" width="2" begin="1" end="0" resetval="0x0" description="Action when event occurs on T1 in UP-Count  Note: By definition, in count up-down mode when the counter equals 0 the direction is defined as 1 or counting up.   00: Do nothing [action disabled]  01: Clear: force EPWMxA output low.  10: Set: force EPWMxA output high.  11: Toggle EPWMxA output: low output signal will be forced high, and a high signal will be forced low." range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G3_EPWM29_AQCTLB" acronym="CONTROLSS_G3_EPWM29_AQCTLB" offset="0x84" width="16" description="Action Qualifier Control Register For Output B ">
		<bitfield id="CBD" width="2" begin="11" end="10" resetval="0x0" description="Action When TBCTR = CMPB on Down Count  Note: By definition, in count up-down mode when the counter equals 0 the direction is defined as 1 or counting up.   00: Do nothing [action disabled]  01: Clear: force EPWMxB output low.  10: Set: force EPWMxB output high.  11: Toggle EPWMxB output: low output signal will be forced high, and a high signal will be forced low." range="11 - 10" rwaccess="R/W"/> 
		<bitfield id="CBU" width="2" begin="9" end="8" resetval="0x0" description="Action When TBCTR = CMPB on Up Count  Note: By definition, in count up-down mode when the counter equals 0 the direction is defined as 1 or counting up.   00: Do nothing [action disabled]  01: Clear: force EPWMxB output low.  10: Set: force EPWMxB output high.  11: Toggle EPWMxB output: low output signal will be forced high, and a high signal will be forced low." range="9 - 8" rwaccess="R/W"/> 
		<bitfield id="CAD" width="2" begin="7" end="6" resetval="0x0" description="Action When TBCTR = CMPA on Down Count  Note: By definition, in count up-down mode when the counter equals 0 the direction is defined as 1 or counting up.   00: Do nothing [action disabled]  01: Clear: force EPWMxB output low.  10: Set: force EPWMxB output high.  11: Toggle EPWMxB output: low output signal will be forced high, and a high signal will be forced low." range="7 - 6" rwaccess="R/W"/> 
		<bitfield id="CAU" width="2" begin="5" end="4" resetval="0x0" description="Action When TBCTR = CMPA on Up Count  Note: By definition, in count up-down mode when the counter equals 0 the direction is defined as 1 or counting up.   00: Do nothing [action disabled]  01: Clear: force EPWMxB output low.  10: Set: force EPWMxB output high.  11: Toggle EPWMxB output: low output signal will be forced high, and a high signal will be forced low." range="5 - 4" rwaccess="R/W"/> 
		<bitfield id="PRD" width="2" begin="3" end="2" resetval="0x0" description="Action When TBCTR = TBPRD  Note: By definition, in count up-down mode when the counter equals 0 the direction is defined as 1 or counting up.   00: Do nothing [action disabled]  01: Clear: force EPWMxB output low.  10: Set: force EPWMxB output high.  11: Toggle EPWMxB output: low output signal will be forced high, and a high signal will be forced low." range="3 - 2" rwaccess="R/W"/> 
		<bitfield id="ZRO" width="2" begin="1" end="0" resetval="0x0" description="Action When TBCTR = 0  Note: By definition, in count up-down mode when the counter equals 0 the direction is defined as 1 or counting up.   00: Do nothing [action disabled]  01: Clear: force EPWMxB output low.  10: Set: force EPWMxB output high.  11: Toggle EPWMxB output: low output signal will be forced high, and a high signal will be forced low." range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G3_EPWM29_AQCTLB2" acronym="CONTROLSS_G3_EPWM29_AQCTLB2" offset="0x86" width="16" description="Additional Action Qualifier Control Register For Output B ">
		<bitfield id="T2D" width="2" begin="7" end="6" resetval="0x0" description="Action when event occurs on T2 in DOWN-Count  Note: By definition, in count up-down mode when the counter equals 0 the direction is defined as 1 or counting up.   00: Do nothing [action disabled]  01: Clear: force EPWMxB output low.  10: Set: force EPWMxB output high.  11: Toggle EPWMxB output: low output signal will be forced high, and a high signal will be forced low." range="7 - 6" rwaccess="R/W"/> 
		<bitfield id="T2U" width="2" begin="5" end="4" resetval="0x0" description="Action when event occurs on T2 in UP-Count  Note: By definition, in count up-down mode when the counter equals 0 the direction is defined as 1 or counting up.   00: Do nothing [action disabled]  01: Clear: force EPWMxB output low.  10: Set: force EPWMxB output high.  11: Toggle EPWMxB output: low output signal will be forced high, and a high signal will be forced low." range="5 - 4" rwaccess="R/W"/> 
		<bitfield id="T1D" width="2" begin="3" end="2" resetval="0x0" description="Action when event occurs on T1 in DOWN-Count  Note: By definition, in count up-down mode when the counter equals 0 the direction is defined as 1 or counting up.   00: Do nothing [action disabled]  01: Clear: force EPWMxB output low.  10: Set: force EPWMxB output high.  11: Toggle EPWMxB output: low output signal will be forced high, and a high signal will be forced low." range="3 - 2" rwaccess="R/W"/> 
		<bitfield id="T1U" width="2" begin="1" end="0" resetval="0x0" description="Action when event occurs on T1 in UP-Count  Note: By definition, in count up-down mode when the counter equals 0 the direction is defined as 1 or counting up.   00: Do nothing [action disabled]  01: Clear: force EPWMxB output low.  10: Set: force EPWMxB output high.  11: Toggle EPWMxB output: low output signal will be forced high, and a high signal will be forced low." range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G3_EPWM29_AQSFRC" acronym="CONTROLSS_G3_EPWM29_AQSFRC" offset="0x8E" width="16" description="Action Qualifier Software Force Register">
		<bitfield id="RLDCSF" width="2" begin="7" end="6" resetval="0x0" description="AQCSFRC Active Register Reload From Shadow Options   00: Load on event counter equals zero  01: Load on event counter equals period  10: Load on event counter equals zero or counter equals period  11: Load immediately [the active register is directly accessed by the CPU and is not loaded from the shadow register]." range="7 - 6" rwaccess="R/W"/> 
		<bitfield id="OTSFB" width="1" begin="5" end="5" resetval="0x0" description="One-Time Software Forced Event on Output B   0: Writing a 0 [zero] has no effect. Always reads back a 0. This bit is auto cleared once a write to this register is complete [i.e., a forced event is initiated.]. This is a one-shot forced event. It can be overridden by another subsequent event on output B.  1: Initiates a single software forced event" range="5" rwaccess="R/W1TS"/> 
		<bitfield id="ACTSFB" width="2" begin="4" end="3" resetval="0x0" description="Action When One-Time Software Force B is Invoked   00: Does nothing [action disabled]  01: Clear [low]  10: Set [high]  11: Toggle [Low -> High, High -> Low]  Note: This action is not qualified by counter direction [CNT_dir]" range="4 - 3" rwaccess="R/W"/> 
		<bitfield id="OTSFA" width="1" begin="2" end="2" resetval="0x0" description="One-Time Software Forced Event on Output A   0: Writing a 0 [zero] has no effect. Always reads back a 0. This bit is auto cleared once a write to this register is complete [ i.e., a forced event is initiated].  This is a one-shot forced event. It can be overridden by another subsequent event on output A.  1: Initiates a single software forced event" range="2" rwaccess="R/W1TS"/> 
		<bitfield id="ACTSFA" width="2" begin="1" end="0" resetval="0x0" description="Action When One-Time Software Force A Is Invoked   00: Does nothing [action disabled]  01: Clear [low]  10: Set [high]  11: Toggle [Low -> High, High -> Low]  Note: This action is not qualified by counter direction [CNT_dir]" range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G3_EPWM29_AQCSFRC" acronym="CONTROLSS_G3_EPWM29_AQCSFRC" offset="0x92" width="16" description="Action Qualifier Continuous S/W Force Register ">
		<bitfield id="CSFB" width="2" begin="3" end="2" resetval="0x0" description="Continuous Software Force on Output B  In immediate mode, a continuous force takes effect on the next TBCLK edge. In shadow mode, a continuous force takes effect on the next TBCLK edge after a shadow load into the active register. To configure shadow mode, use AQSFRC[RLDCSF].   00: Software forcing is disabled and has no effect  01: Forces a continuous low on output B  10: Forces a continuous high on output B  11: Software forcing is disabled and has no effect" range="3 - 2" rwaccess="R/W"/> 
		<bitfield id="CSFA" width="2" begin="1" end="0" resetval="0x0" description="Continuous Software Force on Output A  In immediate mode, a continuous force takes effect on the next TBCLK edge. In shadow mode, a continuous force takes effect on the next TBCLK edge after a shadow load into the active register.   00: Software forcing is disabled and has no effect  01: Forces a continuous low on output A  10: Forces a continuous high on output A  11: Software forcing is disabled and has no effect" range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G3_EPWM29_DBREDHR" acronym="CONTROLSS_G3_EPWM29_DBREDHR" offset="0xA0" width="16" description="Dead-Band Generator Rising Edge Delay High Resolution Mirror Register ">
		<bitfield id="DBREDHR" width="7" begin="15" end="9" resetval="0x0" description="Dead Band Rising Edge Delay High Resolution Bits" range="15 - 9" rwaccess="R/W"/> 
		<bitfield id="DBREDHR_DELAY" width="7" begin="7" end="1" resetval="0x0" description="These 7-bits contain the results of OTTO calculation [if auto-conversion is enabled]" range="7 - 1" rwaccess="R"/>
	</register>
	<register id="CONTROLSS_G3_EPWM29_DBRED" acronym="CONTROLSS_G3_EPWM29_DBRED" offset="0xA2" width="16" description="Dead-Band Generator Rising Edge Delay High Resolution Mirror Register ">
		<bitfield id="DBRED" width="14" begin="13" end="0" resetval="0x0" description="Rising edge delay value" range="13 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G3_EPWM29_DBFEDHR" acronym="CONTROLSS_G3_EPWM29_DBFEDHR" offset="0xA4" width="16" description="Dead-Band Generator Falling Edge Delay High Resolution Register ">
		<bitfield id="DBFEDHR" width="7" begin="15" end="9" resetval="0x0" description="Dead Band Falling Edge Delay High Resolution Bits" range="15 - 9" rwaccess="R/W"/> 
		<bitfield id="DBFEDHR_DELAY" width="7" begin="7" end="1" resetval="0x0" description="These 7-bits contain the results of OTTO calculation [if auto-conversion is enabled]" range="7 - 1" rwaccess="R"/>
	</register>
	<register id="CONTROLSS_G3_EPWM29_DBFED" acronym="CONTROLSS_G3_EPWM29_DBFED" offset="0xA6" width="16" description="Dead-Band Generator Falling Edge Delay Count Register">
		<bitfield id="DBFED" width="14" begin="13" end="0" resetval="0x0" description="Falling Edge Delay Count   14-bit counter" range="13 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G3_EPWM29_TBPHS" acronym="CONTROLSS_G3_EPWM29_TBPHS" offset="0xC0" width="32" description="Time Base Phase High">
		<bitfield id="TBPHS" width="16" begin="31" end="16" resetval="0x0" description="Phase Offset Register  These bits set time-base counter phase of the selected ePWM relative to the time-base that is supplying the synchronization input signal.  - If TBCTL[PHSEN] = 0, then the synchronization event is ignored and the time-base counter is not loaded with the phase. - If TBCTL[PHSEN] = 1, then the time-base counter [TBCTR] will be loaded with the phase [TBPHS] when a synchronization event occurs. The synchronization event can be initiated by the input synchronization signal [EPWMxSYNCI] or by a software forced synchronization." range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="TBPHSHR" width="16" begin="15" end="0" resetval="0x0" description="Phase Offset [High Resolution] Register. TBPHSHR must not be used. Instead TRREM [HRPWM remainder register] must be used to mimic the functionality of TBPHSHR.   The lower 8 bits in this register are ignored - writes are ignored and reads return zero" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G3_EPWM29_TBPRDHR" acronym="CONTROLSS_G3_EPWM29_TBPRDHR" offset="0xC4" width="16" description="Time Base Period High Resolution Register ">
		<bitfield id="TBPRDHR" width="16" begin="15" end="0" resetval="0x0" description="Period High Resolution Bits  The upper 8-bits contain the high-resolution portion of the period value. The TBPRDHR register is not affected by the TBCTL[PRDLD] bit. Reads from this register always reflect the shadow register. Likewise writes are also to the shadow register. The TBPRDHR register is only used when the high resolution period feature is enabled. This register is only available with ePWM modules which support high-resolution period control.  The lower 8 bits in this register are ignored - writes are ignored and reads return zero" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G3_EPWM29_TBPRD" acronym="CONTROLSS_G3_EPWM29_TBPRD" offset="0xC6" width="16" description="Time Base Period Register ">
		<bitfield id="TBPRD" width="16" begin="15" end="0" resetval="0x0" description="Time Base Period Register  These bits determine the period of the time-base counter. This sets the PWM frequency. Shadowing of this register is enabled and disabled by the TBCTL[PRDLD] bit. By default this register is shadowed. - If TBCTL[PRDLD] = 0, then the shadow is enabled and any write or read will automatically go to the shadow register. In this case, the active register will be loaded from the shadow register when the time-base counter equals zero. - If TBCTL[PRDLD] = 1, then the shadow is disabled and any write or read will go directly to the active register, that is the register actively controlling the hardware. - The active and shadow registers share the same memory map address." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G3_EPWM29_TBPRDHRB" acronym="CONTROLSS_G3_EPWM29_TBPRDHRB" offset="0xC8" width="16" description="Calculation Result for EPWMxB">
		<bitfield id="TBPRDHRB" width="8" begin="15" end="8" resetval="0x0" description="TBPRD High Resolution Calculation [2] Results for EPWMxB HRPWM Equations" range="15 - 8" rwaccess="R/W"/> 
		<bitfield id="TBPRDHRB_DELAY" width="8" begin="7" end="0" resetval="0x0" description="TBPRDHRB Delay" range="7 - 0" rwaccess="R/W"/>
	</register>
