IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_G3_EPWM29_CONTROLSS_G3_EPWM29.xml
	<register id="CONTROLSS_G3_EPWM29_TZCTLDCB" acronym="CONTROLSS_G3_EPWM29_TZCTLDCB" offset="0x10E" width="16" description="Trip Zone Control Register Digital Compare B ">
		<bitfield id="DCBEVT2D" width="3" begin="11" end="9" resetval="0x0" description="Digital Compare Output B Event 2 Action On EPWMxB while Count direction is DOWN   000: HiZ [EPWMxB = HiZ state]  001: Forced Hi [EPWMxB = High state]  010: Forced Lo [EPWMxB = Lo state]  011: Toggle [Low -> High, High -> Low]  100: Reserved  101: Reserved  110: Reserved  111: Do Nothing, trip action is disabled" range="11 - 9" rwaccess="R/W"/> 
		<bitfield id="DCBEVT2U" width="3" begin="8" end="6" resetval="0x0" description="Digital Compare Output B Event 2 Action On EPWMxB while Count direction is UP   000: HiZ [EPWMxB = HiZ state]  001: Forced Hi [EPWMxB = High state]  010: Forced Lo [EPWMxB = Lo state]  011: Toggle [Low -> High, High -> Low]  100: Reserved  101: Reserved  110: Reserved  111: Do Nothing, trip action is disabled" range="8 - 6" rwaccess="R/W"/> 
		<bitfield id="DCBEVT1D" width="3" begin="5" end="3" resetval="0x0" description="Digital Compare Output B Event 1 Action On EPWMxB while Count direction is DOWN   000: HiZ [EPWMxB = HiZ state]  001: Forced Hi [EPWMxB = High state]  010: Forced Lo [EPWMxB = Lo state]  011: Toggle [Low -> High, High -> Low]  100: Reserved  101: Reserved  110: Reserved  111: Do Nothing, trip action is disabled" range="5 - 3" rwaccess="R/W"/> 
		<bitfield id="DCBEVT1U" width="3" begin="2" end="0" resetval="0x0" description="Digital Compare Output B Event 1 Action On EPWMxB while Count direction is UP   000: HiZ [EPWMxB = HiZ state]  001: Forced Hi [EPWMxB = High state]  010: Forced Lo [EPWMxB = Lo state]  011: Toggle [Low -> High, High -> Low]  100: Reserved  101: Reserved  110: Reserved  111: Do Nothing, trip action is disabled" range="2 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G3_EPWM29_TZEINT" acronym="CONTROLSS_G3_EPWM29_TZEINT" offset="0x11A" width="16" description="Trip Zone Enable Interrupt Register">
		<bitfield id="CAPEVT" width="1" begin="7" end="7" resetval="0x0" description="Capture Event Interrupt Enable   0: Disabled  1: Enabled" range="7" rwaccess="R/W"/> 
		<bitfield id="DCBEVT2" width="1" begin="6" end="6" resetval="0x0" description="Digital Compare Output B Event 2 Interrupt Enable   0: Disabled  1: Enabled" range="6" rwaccess="R/W"/> 
		<bitfield id="DCBEVT1" width="1" begin="5" end="5" resetval="0x0" description="Digital Compare Output B Event 1 Interrupt Enable   0: Disabled  1: Enabled" range="5" rwaccess="R/W"/> 
		<bitfield id="DCAEVT2" width="1" begin="4" end="4" resetval="0x0" description="Digital Compare Output A Event 2 Interrupt Enable   0: Disabled  1: Enabled" range="4" rwaccess="R/W"/> 
		<bitfield id="DCAEVT1" width="1" begin="3" end="3" resetval="0x0" description="Digital Compare Output A Event 1 Interrupt Enable   0: Disabled  1: Enabled" range="3" rwaccess="R/W"/> 
		<bitfield id="OST" width="1" begin="2" end="2" resetval="0x0" description="Trip-zone One-Shot Interrupt Enable   0: Disable one-shot interrupt generation  1: Enable Interrupt generation  a one-shot trip event will cause a EPWMx_TZINT PIE interrupt." range="2" rwaccess="R/W"/> 
		<bitfield id="CBC" width="1" begin="1" end="1" resetval="0x0" description="Trip-zone Cycle-by-Cycle Interrupt Enable   0: Disable cycle-by-cycle interrupt generation.  1: Enable interrupt generation  a cycle-by-cycle trip event will cause an EPWMx_TZINT PIE interrupt." range="1" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G3_EPWM29_TZFLG" acronym="CONTROLSS_G3_EPWM29_TZFLG" offset="0x126" width="16" description="Trip Zone Flag Register">
		<bitfield id="CAPEVT" width="1" begin="7" end="7" resetval="0x0" description="Latched Status Flag for Capture Event   0: Indicates no trip event has occurred on CAPEVT  1: Indicates a trip event has occurred for the event defined for CAPEVT" range="7" rwaccess="R"/> 
		<bitfield id="DCBEVT2" width="1" begin="6" end="6" resetval="0x0" description="Latched Status Flag for Digital Compare Output B Event 2   0: Indicates no trip event has occurred on DCBEVT2  1: Indicates a trip event has occurred for the event defined for DCBEVT2" range="6" rwaccess="R"/> 
		<bitfield id="DCBEVT1" width="1" begin="5" end="5" resetval="0x0" description="Latched Status Flag for Digital Compare Output B Event 1    0: Indicates no trip event has occurred on DCBEVT1  1: Indicates a trip event has occurred for the event defined for DCBEVT1" range="5" rwaccess="R"/> 
		<bitfield id="DCAEVT2" width="1" begin="4" end="4" resetval="0x0" description="Latched Status Flag for Digital Compare Output A Event 2   0: Indicates no trip event has occurred on DCAEVT2  1: Indicates a trip event has occurred for the event defined for DCAEVT2" range="4" rwaccess="R"/> 
		<bitfield id="DCAEVT1" width="1" begin="3" end="3" resetval="0x0" description="Latched Status Flag for Digital Compare Output A Event 1   0: Indicates no trip event has occurred on DCAEVT1  1: Indicates a trip event has occurred for the event defined for DCAEVT1" range="3" rwaccess="R"/> 
		<bitfield id="OST" width="1" begin="2" end="2" resetval="0x0" description="Latched Status Flag for A One-Shot Trip Event   0: No one-shot trip event has occurred.  1: Indicates a trip event has occurred on a pin selected as a one-shot trip source.  This bit is cleared by writing the appropriate value to the TZCLR register." range="2" rwaccess="R"/> 
		<bitfield id="CBC" width="1" begin="1" end="1" resetval="0x0" description="Latched Status Flag for Cycle-By-Cycle Trip Event   0: No cycle-by-cycle trip event has occurred.  1: Indicates a trip event has occurred on a signal selected as a cycle-by-cycle trip source. The  TZFLG[CBC] bit will remain set until it is manually cleared by the user. If the cycle-by-cycle trip event is still present when the CBC bit is cleared, then CBC will be immediately set again. The specified condition on the signal is automatically cleared when the ePWM time-base counter reaches zero [TBCTR = 0x00] if the trip condition is no longer present. The condition on the signal is only cleared when the TBCTR = 0x00 no matter where in the cycle the CBC flag is cleared.  This bit is cleared by writing the appropriate value to the TZCLR register." range="1" rwaccess="R"/> 
		<bitfield id="INT" width="1" begin="0" end="0" resetval="0x0" description="Latched Trip Interrupt Status Flag   0: Indicates no interrupt has been generated.  1: Indicates an EPWMx_TZINT PIE interrupt was generated because of a trip condition.  No further EPWMx_TZINT PIE interrupts will be generated until this flag is cleared. If the interrupt flag is cleared when either CBC or OST is set, then another interrupt pulse will be generated. Clearing all flag bits will prevent further interrupts. This bit is cleared by writing the appropriate value to the TZCLR register." range="0" rwaccess="R"/>
	</register>
	<register id="CONTROLSS_G3_EPWM29_TZCBCFLG" acronym="CONTROLSS_G3_EPWM29_TZCBCFLG" offset="0x128" width="16" description="Trip Zone CBC Flag Register">
		<bitfield id="CAPEVT" width="1" begin="8" end="8" resetval="0x0" description="Latched Status Flag for Capture Event   0: Indicates no trip event has occurred on CAPEVT  1: Indicates a trip event has occurred for the event defined for CAPEVT" range="8" rwaccess="R"/> 
		<bitfield id="DCBEVT2" width="1" begin="7" end="7" resetval="0x0" description="Latched Status Flag for Digital Compare B Output Event 2 Trip Latch   0: Reading a 0 indicates that no trip has occurred on DCBEVT2.  1: Reading a 1 indicates a trip has occured on the DCBEVT2 selected event." range="7" rwaccess="R"/> 
		<bitfield id="DCAEVT2" width="1" begin="6" end="6" resetval="0x0" description="Latched Status Flag for Digital Compare A Output Event 2 Trip Latch   0: Reading a 0 indicates that no trip has occurred on DCAEVT2.  1: Reading a 1 indicates a trip has occured on the DCAEVT2 selected event." range="6" rwaccess="R"/> 
		<bitfield id="CBC6" width="1" begin="5" end="5" resetval="0x0" description="Latched Status Flag for CBC6 Trip Latch   0: Reading a 0 indicates that no trip has occurred on CBC6.  1: Reading a 1 indicates a trip has occured on the CBC6 selected event." range="5" rwaccess="R"/> 
		<bitfield id="CBC5" width="1" begin="4" end="4" resetval="0x0" description="Latched Status Flag for CBC5 Trip Latch   0: Reading a 0 indicates that no trip has occurred on CBC5.  1: Reading a 1 indicates a trip has occured on the CBC5 selected event." range="4" rwaccess="R"/> 
		<bitfield id="CBC4" width="1" begin="3" end="3" resetval="0x0" description="Latched Status Flag for CBC4 Trip Latch   0: Reading a 0 indicates that no trip has occurred on CBC4.  1: Reading a 1 indicates a trip has occured on the CBC4 selected event." range="3" rwaccess="R"/> 
		<bitfield id="CBC3" width="1" begin="2" end="2" resetval="0x0" description="Latched Status Flag for CBC3 Trip Latch   0: Reading a 0 indicates that no trip has occurred on CBC3.  1: Reading a 1 indicates a trip has occured on the CBC3 selected event." range="2" rwaccess="R"/> 
		<bitfield id="CBC2" width="1" begin="1" end="1" resetval="0x0" description="Latched Status Flag for CBC2 Trip Latch   0: Reading a 0 indicates that no trip has occurred on CBC2.  1: Reading a 1 indicates a trip has occured on the CBC2 selected event." range="1" rwaccess="R"/> 
		<bitfield id="CBC1" width="1" begin="0" end="0" resetval="0x0" description="Latched Status Flag for CBC1 Trip Latch   0: Reading a 0 indicates that no trip has occurred on CBC1.  1: Reading a 1 indicates a trip has occured on the CBC1 selected event." range="0" rwaccess="R"/>
	</register>
	<register id="CONTROLSS_G3_EPWM29_TZOSTFLG" acronym="CONTROLSS_G3_EPWM29_TZOSTFLG" offset="0x12A" width="16" description="Trip Zone OST Flag Register">
		<bitfield id="CAPEVT" width="1" begin="8" end="8" resetval="0x0" description="Latched Status Flag for Capture Event   0: Indicates no trip event has occurred on CAPEVT  1: Indicates a trip event has occurred for the event defined for CAPEVT" range="8" rwaccess="R"/> 
		<bitfield id="DCBEVT1" width="1" begin="7" end="7" resetval="0x0" description="Latched Status Flag for Digital Compare B Output Event 1 Trip Latch   0: Reading a 0 indicates that no trip has occurred on DCBEVT1.  1: Reading a 1 indicates a trip has occured on the DCBEVT1 selected event." range="7" rwaccess="R"/> 
		<bitfield id="DCAEVT1" width="1" begin="6" end="6" resetval="0x0" description="Latched Status Flag for Digital Compare A Output Event 1 Trip Latch   0: Reading a 0 indicates that no trip has occurred on DCAEVT1.  1: Reading a 1 indicates a trip has occured on the DCAEVT1 selected event." range="6" rwaccess="R"/> 
		<bitfield id="OST6" width="1" begin="5" end="5" resetval="0x0" description="Latched Status Flag for OST6 Trip Latch   0: Reading a 0 indicates that no trip has occurred on OST6.  1: Reading a 1 indicates a trip has occured on the OST6 selected event." range="5" rwaccess="R"/> 
		<bitfield id="OST5" width="1" begin="4" end="4" resetval="0x0" description="Latched Status Flag for OST5 Trip Latch   0: Reading a 0 indicates that no trip has occurred on OST5.  1: Reading a 1 indicates a trip has occured on the OST5 selected event." range="4" rwaccess="R"/> 
		<bitfield id="OST4" width="1" begin="3" end="3" resetval="0x0" description="Latched Status Flag for OST4 Trip Latch   0: Reading a 0 indicates that no trip has occurred on OST4.  1: Reading a 1 indicates a trip has occured on the OST4 selected event." range="3" rwaccess="R"/> 
		<bitfield id="OST3" width="1" begin="2" end="2" resetval="0x0" description="Latched Status Flag for OST3 Trip Latch   0: Reading a 0 indicates that no trip has occurred on OST3.  1: Reading a 1 indicates a trip has occured on the OST3 selected event." range="2" rwaccess="R"/> 
		<bitfield id="OST2" width="1" begin="1" end="1" resetval="0x0" description="Latched Status Flag for OST2 Trip Latch   0: Reading a 0 indicates that no trip has occurred on OST2.  1: Reading a 1 indicates a trip has occured on the OST2 selected event." range="1" rwaccess="R"/> 
		<bitfield id="OST1" width="1" begin="0" end="0" resetval="0x0" description="Latched Status Flag for OST1 Trip Latch   0: Reading a 0 indicates that no trip has occurred on OST1.  1: Reading a 1 indicates a trip has occured on the OST1 selected event." range="0" rwaccess="R"/>
	</register>
